IDEA Open Model
RebarSingle Class
Compatible with IDEA StatiCa 20.1
 Represents a single main rebar in 3D space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.RebarBase
 IdeaRS.OpenModel.Model.RebarSingle
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class RebarSingle : RebarBase
Public Class RebarSingle
	Inherits RebarBase
The RebarSingle type exposes the following members.
Constructors
Name | Description
RebarSingle
 create a new instance.
Top
Properties
Name | Description
Diameter
 Gets or sets the Rebar Diameter.
 (Inherited from RebarBase.)
GroupId
 identity for group identification number
 (Inherited from RebarBase.)
Id
 Element Id
 (Inherited from OpenElementId.)
Material
 Gets or sets the reference of material properties.
 (Inherited from RebarBase.)
RebarAllocationElement
 the element where this rebar belongs (part of that beam)
 (Inherited from RebarBase.)
RebarParentElement
 Gets or sets the reference element of the geometry of the reference line (line along which the rebars are generated). It can be IdeaRS.OpenModel.Geometry3D.Segment3D or IdeaRS.OpenModel.Geometry3D.PolyLine3D or IdeaRS.OpenModel.Model.Member1D or IdeaRS.OpenModel.Model.Element1D
 (Inherited from RebarBase.)
RebarShape
 Gets or sets the geometrical shape of the rebar. IdeaRS.OpenModel.Model.RebarShape
 (Inherited from RebarBase.)
RotationXrad
 Returns the rotation (in radians) of the rebar geometry (RebarShape). It is an angle of rotation around AxisX of the reference line.
Translation
 Returns the translation of the rebar geometry (RebarShape). It is an Insert point in reference line coordinate system
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace